ГТС/УТГТС/Catalogs/СтатьиДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиДвиженияДенежныхСредств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КорреспондирующийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитываетсяВНалоговойБазеАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХозяйственныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/CommonModules/ИнтеграцияСЯндексКассойУТКлиент/Ext/Module.bsl
#Область ЗагрузкаОпераций

Процедура НачатьЗагрузкуОперацийПоЯндексКассе(Знач ПараметрыЗагрузки, Знач ОписаниеОповещения = Неопределено, ВыводитьОкноОжидания = Истина) Экспорт
	
	ДлительнаяОперация = ИнтеграцияСЯндексКассойУТВызовСервера.НачатьЗагрузкуОперацийПоЯндексКассе(ПараметрыЗагрузки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Загрузка операций по Яндекс.Кассе'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ЭлементФормыНастроекПриИзменении(Контекст, Элемент) Экспорт
	
	Форма = Контекст.Форма;
	Префикс = Контекст.Префикс;
	ДополнительныеПараметрыФормы = Форма[Префикс + "ДополнительныеПараметрыФормы"];
	
	Если Элемент.Имя = Префикс + "СтатьяРасходов" Тогда
		
		ДоходыИРасходыКлиентСервер.СтатьяПриИзменении(Форма, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭлементФормыНастроекНачалоВыбора(Контекст, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	Форма = Контекст.Форма;
	Префикс = Контекст.Префикс;
	ДополнительныеПараметрыФормы = Форма[Префикс + "ДополнительныеПараметрыФормы"];
	
	Если Элемент.Имя = Префикс + "СтатьяДвиженияДенежныхСредствОплаты"
		Или Элемент.Имя = Префикс + "СтатьяДвиженияДенежныхСредствВозвраты" Тогда 
		
		Если Элемент.Имя = Префикс + "СтатьяДвиженияДенежныхСредствОплаты" Тогда 
			ХозяйственнаяОперация = 
			ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента");
		ИначеЕсли Элемент.Имя = Префикс + "СтатьяДвиженияДенежныхСредствВозвраты" Тогда 
			ХозяйственнаяОперация = 
			ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту");
		Иначе
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура();
		Отбор.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперация);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Отбор",         Отбор);
		ПараметрыФормы.Вставить("ТекущаяСтрока", Форма[Элемент.Имя]);
		
		ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаВыбора", 
		ПараметрыФормы, Элемент, Форма.УникальныйИдентификатор);
		
	ИначеЕсли Элемент.Имя = Префикс + "СтатьяРасходов" Тогда 
		
		ДоходыИРасходыКлиент.НачалоВыбораСтатьи(Форма, Элемент, СтандартнаяОбработка);
		
	ИначеЕсли Элемент.Имя = Префикс + "АналитикаРасходов" Тогда 
		
		ДоходыИРасходыКлиент.НачалоВыбораАналитикиРасходов(Форма, Элемент, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭлементФормыНастроекОбработкаВыбора(Контекст, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Форма = Контекст.Форма;
	Префикс = Контекст.Префикс;

КонецПроцедуры

Процедура ЭлементФормыНастроекСоздание(Контекст, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Основание", ИнтеграцияСЯндексКассойУТВызовСервера.ДанныеЭквайераПоУмолчанию());
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, Элемент, Контекст.Форма.УникальныйИдентификатор); 
	
КонецПроцедуры

#КонецОбласти
